FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/StdDriver/src/rtc.c
/**************************************************************************//**
 * @file     rtc.c
 * @version  V3.00
 * @brief    Real Time Clock(RTC) driver source file
 *
 * @copyright (C) 2016 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/
#include "NuMicro.h"


/** @cond HIDDEN_SYMBOLS */

/*---------------------------------------------------------------------------------------------------------*/
/* Macro, type and constant definitions                                                                    */
/*---------------------------------------------------------------------------------------------------------*/
#define RTC_GLOBALS

/*---------------------------------------------------------------------------------------------------------*/
/* Global file scope (static) variables                                                                    */
/*---------------------------------------------------------------------------------------------------------*/
static volatile uint32_t g_u32hiYear, g_u32loYear, g_u32hiMonth, g_u32loMonth, g_u32hiDay, g_u32loDay;
static volatile uint32_t g_u32hiHour, g_u32loHour, g_u32hiMin, g_u32loMin, g_u32hiSec, g_u32loSec;

/** @endcond HIDDEN_SYMBOLS */


/** @addtogroup Standard_Driver Standard Driver
 * @{
 */

/** @addtogroup RTC_Driver RTC Driver
 * @{
 */

/** @addtogroup RTC_EXPORTED_FUNCTIONS RTC Exported Functions
 * @{
 */

/**
 * @brief      Initialize RTC module and start counting
 *
 * @param[in]  sPt     Specify the time property and current date and time. It includes:           \n
 *                     u32Year: Year value, range between 2000 ~ 2099.                             \n
 *                     u32Month: Month value, range between 1 ~ 12.                                \n
 *                     u32Day: Day value, range between 1 ~ 31.                                    \n
 *                     u32DayOfWeek: Day of the week. [RTC_SUNDAY / RTC_MONDAY / RTC_TUESDAY /
 *                                                     RTC_WEDNESDAY / RTC_THURSDAY / RTC_FRIDAY /
 *                                                     RTC_SATURDAY]                               \n
 *                     u32Hour: Hour value, range between 0 ~ 23.                                  \n
 *                     u32Minute: Minute value, range between 0 ~ 59.                              \n
 *                     u32Second: Second value, range between 0 ~ 59.                              \n
 *                     u32TimeScale: [RTC_CLOCK_12 / RTC_CLOCK_24]                                 \n
 *                     u8AmPm: [RTC_AM / RTC_PM]                                                   \n
 *
 * @return     None
 *
 * @details    This function is used to: \n
 *                 1. Write initial key to let RTC start count.  \n
 *                 2. Input parameter indicates start date/time. \n
 *                 3. User has to make sure that parameters of RTC date/time are reasonable. \n
 * @note       Null pointer for using default starting date/time.
 */
void RTC_Open( S_RTC_TIME_DATA_T * sPt )
{
    RTC_T * pRTC;

    if( ( __PC() & NS_OFFSET ) == NS_OFFSET )
    {
        pRTC = RTC_NS;
    }
    else
    {
        pRTC = RTC;
    }

    pRTC->INIT = RTC_INIT_KEY;

    if( pRTC->INIT != RTC_INIT_ACTIVE_Msk )
    {
        pRTC->INIT = RTC_INIT_KEY;

        while( pRTC->INIT != RTC_INIT_ACTIVE_Msk )
        {
        }
    }

    if( sPt == 0 )
    {
        /* No RTC date/time data */
    }
    else
    {
        /* Set RTC date and time */
        RTC_SetDateAndTime( sPt );
    }
}

/**
 * @brief      Disable RTC Clock
 *
 * @param      None
 *
 * @return     None
 *
 * @details    This API will disable RTC peripheral clock and stops RTC counting.
 */
void RTC_Close( void )
{
    if( ( __PC() & NS_OFFSET ) == NS_OFFSET )
    {
        /* Disable RTC clock in secure mode only */
    }
    else
    {
        CLK->APBCLK0 &= ~CLK_APBCLK0_RTCCKEN_Msk;
    }
}

/**
 * @brief      Set 32k Frequency Compensation Data
 *
 *  @param[in]    i32FrequencyX10000    Specify the RTC clock X10000, ex: 327736512 means 32773.6512.
 *
 * @return     None
 *
 * @details    This API is used to compensate the 32 kHz frequency by current LXT frequency for RTC application.
 */
void RTC_32KCalibration( int32_t i32FrequencyX10000 )
{
    uint64_t u64Compensate;
    RTC_T * pRTC;

    if( ( __PC() & NS_OFFSET ) == NS_OFFSET )
    {
        pRTC = RTC_NS;
    }
    else
    {
        pRTC = RTC;
    }

    /* u64Compensate = (uint64_t)(0x64000000000); */
    u64Compensate = ( uint64_t ) ( 0x2710000000000 );
    u64Compensate = ( uint64_t ) ( u64Compensate / ( uint64_t ) i32FrequencyX10000 );

    /*
     *  Formula for 32K compensation is
     *      FREQADJ = 0x200000 * (32768 / LXT_freq)
     */
    if( u64Compensate >= ( uint64_t ) 0x400000 )
    {
        u64Compensate = ( uint64_t ) 0x3FFFFF;
    }

    RTC_WaitAccessEnable();
    pRTC->FREQADJ = ( uint32_t ) u64Compensate;
}

/**
 * @brief      Get Current RTC Date and Time
 *
 * @param[out] sPt     The returned pointer is specified the current RTC value. It includes: \n
 *                     u32Year: Year value                                                   \n
 *                     u32Month: Month value                                                 \n
 *                     u32Day: Day value                                                     \n
 *                     u32DayOfWeek: Day of week                                             \n
 *                     u32Hour: Hour value                                                   \n
 *                     u32Minute: Minute value                                               \n
 *                     u32Second: Second value                                               \n
 *                     u32TimeScale: [RTC_CLOCK_12 / RTC_CLOCK_24]                           \n
 *                     u8AmPm: [RTC_AM / RTC_PM]                                             \n
 *
 * @return     None
 *
 * @details    This API is used to get the current RTC date and time value.
 */
void RTC_GetDateAndTime( S_RTC_TIME_DATA_T * sPt )
{
    uint32_t u32Tmp;
    RTC_T * pRTC;

    if( ( __PC() & NS_OFFSET ) == NS_OFFSET )
    {
        pRTC = RTC_NS;
    }
    else
    {
        pRTC = RTC;
    }

    sPt->u32TimeScale = pRTC->CLKFMT & RTC_CLKFMT_24HEN_Msk;     /* 12/24-hour */
    sPt->u32DayOfWeek = pRTC->WEEKDAY & RTC_WEEKDAY_WEEKDAY_Msk; /* Day of the week */

    /* Get [Date digit] data */
    g_u32hiYear = ( pRTC->CAL & RTC_CAL_TENYEAR_Msk ) >> RTC_CAL_TENYEAR_Pos;
    g_u32loYear = ( pRTC->CAL & RTC_CAL_YEAR_Msk ) >> RTC_CAL_YEAR_Pos;
    g_u32hiMonth = ( pRTC->CAL & RTC_CAL_TENMON_Msk ) >> RTC_CAL_TENMON_Pos;
    g_u32loMonth = ( pRTC->CAL & RTC_CAL_MON_Msk ) >> RTC_CAL_MON_Pos;
    g_u32hiDay = ( pRTC->CAL & RTC_CAL_TENDAY_Msk ) >> RTC_CAL_TENDAY_Pos;
    g_u32loDay = ( pRTC->CAL & RTC_CAL_DAY_Msk ) >> RTC_CAL_DAY_Pos;

