FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/StdDriver/src/rtc.c
    /* Get [Time digit] data */
    g_u32hiHour = ( pRTC->TIME & RTC_TIME_TENHR_Msk ) >> RTC_TIME_TENHR_Pos;
    g_u32loHour = ( pRTC->TIME & RTC_TIME_HR_Msk ) >> RTC_TIME_HR_Pos;
    g_u32hiMin = ( pRTC->TIME & RTC_TIME_TENMIN_Msk ) >> RTC_TIME_TENMIN_Pos;
    g_u32loMin = ( pRTC->TIME & RTC_TIME_MIN_Msk ) >> RTC_TIME_MIN_Pos;
    g_u32hiSec = ( pRTC->TIME & RTC_TIME_TENSEC_Msk ) >> RTC_TIME_TENSEC_Pos;
    g_u32loSec = ( pRTC->TIME & RTC_TIME_SEC_Msk ) >> RTC_TIME_SEC_Pos;

    /* Compute to 20XX year */
    u32Tmp = ( g_u32hiYear * 10UL );
    u32Tmp += g_u32loYear;
    sPt->u32Year = u32Tmp + ( uint32_t ) RTC_YEAR2000;

    /* Compute 0~12 month */
    u32Tmp = ( g_u32hiMonth * 10UL );
    sPt->u32Month = u32Tmp + g_u32loMonth;

    /* Compute 0~31 day */
    u32Tmp = ( g_u32hiDay * 10UL );
    sPt->u32Day = u32Tmp + g_u32loDay;

    /* Compute 12/24 hour */
    if( sPt->u32TimeScale == ( uint32_t ) RTC_CLOCK_12 )
    {
        u32Tmp = ( g_u32hiHour * 10UL );
        u32Tmp += g_u32loHour;
        sPt->u32Hour = u32Tmp; /* AM: 1~12. PM: 21~32. */

        if( sPt->u32Hour >= 21UL )
        {
            sPt->u32AmPm = ( uint32_t ) RTC_PM;
            sPt->u32Hour -= 20UL;
        }
        else
        {
            sPt->u32AmPm = ( uint32_t ) RTC_AM;
        }

        u32Tmp = ( g_u32hiMin * 10UL );
        u32Tmp += g_u32loMin;
        sPt->u32Minute = u32Tmp;

        u32Tmp = ( g_u32hiSec * 10UL );
        u32Tmp += g_u32loSec;
        sPt->u32Second = u32Tmp;
    }
    else
    {
        u32Tmp = ( g_u32hiHour * 10UL );
        u32Tmp += g_u32loHour;
        sPt->u32Hour = u32Tmp;

        u32Tmp = ( g_u32hiMin * 10UL );
        u32Tmp += g_u32loMin;
        sPt->u32Minute = u32Tmp;

        u32Tmp = ( g_u32hiSec * 10UL );
        u32Tmp += g_u32loSec;
        sPt->u32Second = u32Tmp;
    }
}

/**
 * @brief      Get RTC Alarm Date and Time
 *
 * @param[out] sPt     The returned pointer is specified the RTC alarm value. It includes: \n
 *                     u32Year: Year value                                                 \n
 *                     u32Month: Month value                                               \n
 *                     u32Day: Day value                                                   \n
 *                     u32DayOfWeek: Day of week                                           \n
 *                     u32Hour: Hour value                                                 \n
 *                     u32Minute: Minute value                                             \n
 *                     u32Second: Second value                                             \n
 *                     u32TimeScale: [RTC_CLOCK_12 / RTC_CLOCK_24]                         \n
 *                     u8AmPm: [RTC_AM / RTC_PM]                                           \n
 *
 * @return     None
 *
 * @details    This API is used to get the RTC alarm date and time setting.
 */
void RTC_GetAlarmDateAndTime( S_RTC_TIME_DATA_T * sPt )
{
    uint32_t u32Tmp;
    RTC_T * pRTC;

    if( ( __PC() & NS_OFFSET ) == NS_OFFSET )
    {
        pRTC = RTC_NS;
    }
    else
    {
        pRTC = RTC;
    }

    sPt->u32TimeScale = pRTC->CLKFMT & RTC_CLKFMT_24HEN_Msk;     /* 12/24-hour */
    sPt->u32DayOfWeek = pRTC->WEEKDAY & RTC_WEEKDAY_WEEKDAY_Msk; /* Day of the week */

    /* Get alarm [Date digit] data */
    RTC_WaitAccessEnable();
    g_u32hiYear = ( pRTC->CALM & RTC_CALM_TENYEAR_Msk ) >> RTC_CALM_TENYEAR_Pos;
    g_u32loYear = ( pRTC->CALM & RTC_CALM_YEAR_Msk ) >> RTC_CALM_YEAR_Pos;
    g_u32hiMonth = ( pRTC->CALM & RTC_CALM_TENMON_Msk ) >> RTC_CALM_TENMON_Pos;
    g_u32loMonth = ( pRTC->CALM & RTC_CALM_MON_Msk ) >> RTC_CALM_MON_Pos;
    g_u32hiDay = ( pRTC->CALM & RTC_CALM_TENDAY_Msk ) >> RTC_CALM_TENDAY_Pos;
    g_u32loDay = ( pRTC->CALM & RTC_CALM_DAY_Msk ) >> RTC_CALM_DAY_Pos;

    /* Get alarm [Time digit] data */
    RTC_WaitAccessEnable();
    g_u32hiHour = ( pRTC->TALM & RTC_TALM_TENHR_Msk ) >> RTC_TALM_TENHR_Pos;
    g_u32loHour = ( pRTC->TALM & RTC_TALM_HR_Msk ) >> RTC_TALM_HR_Pos;
    g_u32hiMin = ( pRTC->TALM & RTC_TALM_TENMIN_Msk ) >> RTC_TALM_TENMIN_Pos;
    g_u32loMin = ( pRTC->TALM & RTC_TALM_MIN_Msk ) >> RTC_TALM_MIN_Pos;
    g_u32hiSec = ( pRTC->TALM & RTC_TALM_TENSEC_Msk ) >> RTC_TALM_TENSEC_Pos;
    g_u32loSec = ( pRTC->TALM & RTC_TALM_SEC_Msk ) >> RTC_TALM_SEC_Pos;

    /* Compute to 20XX year */
    u32Tmp = ( g_u32hiYear * 10UL );
    u32Tmp += g_u32loYear;
    sPt->u32Year = u32Tmp + ( uint32_t ) RTC_YEAR2000;

    /* Compute 0~12 month */
    u32Tmp = ( g_u32hiMonth * 10UL );
    sPt->u32Month = u32Tmp + g_u32loMonth;

    /* Compute 0~31 day */
    u32Tmp = ( g_u32hiDay * 10UL );
    sPt->u32Day = u32Tmp + g_u32loDay;

    /* Compute 12/24 hour */
    if( sPt->u32TimeScale == ( uint32_t ) RTC_CLOCK_12 )
    {
        u32Tmp = ( g_u32hiHour * 10UL );
        u32Tmp += g_u32loHour;
        sPt->u32Hour = u32Tmp; /* AM: 1~12. PM: 21~32. */

        if( sPt->u32Hour >= 21UL )
        {
            sPt->u32AmPm = ( uint32_t ) RTC_PM;
            sPt->u32Hour -= 20UL;
        }
        else
        {
            sPt->u32AmPm = ( uint32_t ) RTC_AM;
        }

        u32Tmp = ( g_u32hiMin * 10UL );
        u32Tmp += g_u32loMin;
        sPt->u32Minute = u32Tmp;

        u32Tmp = ( g_u32hiSec * 10UL );
        u32Tmp += g_u32loSec;
        sPt->u32Second = u32Tmp;
    }
    else
    {
        u32Tmp = ( g_u32hiHour * 10UL );
        u32Tmp += g_u32loHour;
        sPt->u32Hour = u32Tmp;

        u32Tmp = ( g_u32hiMin * 10UL );
        u32Tmp += g_u32loMin;
        sPt->u32Minute = u32Tmp;

        u32Tmp = ( g_u32hiSec * 10UL );
        u32Tmp += g_u32loSec;
        sPt->u32Second = u32Tmp;
    }
}

/**
 * @brief      Update Current RTC Date and Time
 *
 * @param[in]  sPt     Specify the time property and current date and time. It includes:           \n
 *                     u32Year: Year value, range between 2000 ~ 2099.                             \n
 *                     u32Month: Month value, range between 1 ~ 12.                                \n
 *                     u32Day: Day value, range between 1 ~ 31.                                    \n
 *                     u32DayOfWeek: Day of the week. [RTC_SUNDAY / RTC_MONDAY / RTC_TUESDAY /
 *                                                     RTC_WEDNESDAY / RTC_THURSDAY / RTC_FRIDAY /
 *                                                     RTC_SATURDAY]                               \n
 *                     u32Hour: Hour value, range between 0 ~ 23.                                  \n
 *                     u32Minute: Minute value, range between 0 ~ 59.                              \n
 *                     u32Second: Second value, range between 0 ~ 59.                              \n
 *                     u32TimeScale: [RTC_CLOCK_12 / RTC_CLOCK_24]                                 \n
 *                     u8AmPm: [RTC_AM / RTC_PM]                                                   \n
 *
 * @return     None
 *
 * @details    This API is used to update current date and time to RTC.
 */
void RTC_SetDateAndTime( S_RTC_TIME_DATA_T * sPt )
{
    uint32_t u32RegCAL, u32RegTIME;
    RTC_T * pRTC;

    if( ( __PC() & NS_OFFSET ) == NS_OFFSET )
    {
        pRTC = RTC_NS;
    }
    else
    {
        pRTC = RTC;
    }

    if( sPt == 0 )
    {
        /* No RTC date/time data */
    }
    else
    {
        /*-----------------------------------------------------------------------------------------------------*/
        /* Set RTC 24/12 hour setting and Day of the Week                                                      */
        /*-----------------------------------------------------------------------------------------------------*/
        RTC_WaitAccessEnable();

