FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/StdDriver/src/rtc.c
        if( sPt->u32TimeScale == ( uint32_t ) RTC_CLOCK_12 )
        {
            pRTC->CLKFMT &= ~RTC_CLKFMT_24HEN_Msk;

            /*-------------------------------------------------------------------------------------------------*/
            /* Important, range of 12-hour PM mode is 21 up to 32                                               */
            /*-------------------------------------------------------------------------------------------------*/
            if( sPt->u32AmPm == ( uint32_t ) RTC_PM )
            {
                sPt->u32Hour += 20UL;
            }
        }
        else
        {
            pRTC->CLKFMT |= RTC_CLKFMT_24HEN_Msk;
        }

        /* Set Day of the Week */
        pRTC->WEEKDAY = sPt->u32DayOfWeek;

        /*-----------------------------------------------------------------------------------------------------*/
        /* Set RTC Current Date and Time                                                                       */
        /*-----------------------------------------------------------------------------------------------------*/
        u32RegCAL = ( ( sPt->u32Year - ( uint32_t ) RTC_YEAR2000 ) / 10UL ) << 20;
        u32RegCAL |= ( ( ( sPt->u32Year - ( uint32_t ) RTC_YEAR2000 ) % 10UL ) << 16 );
        u32RegCAL |= ( ( sPt->u32Month / 10UL ) << 12 );
        u32RegCAL |= ( ( sPt->u32Month % 10UL ) << 8 );
        u32RegCAL |= ( ( sPt->u32Day / 10UL ) << 4 );
        u32RegCAL |= ( sPt->u32Day % 10UL );

        u32RegTIME = ( ( sPt->u32Hour / 10UL ) << 20 );
        u32RegTIME |= ( ( sPt->u32Hour % 10UL ) << 16 );
        u32RegTIME |= ( ( sPt->u32Minute / 10UL ) << 12 );
        u32RegTIME |= ( ( sPt->u32Minute % 10UL ) << 8 );
        u32RegTIME |= ( ( sPt->u32Second / 10UL ) << 4 );
        u32RegTIME |= ( sPt->u32Second % 10UL );

        /*-----------------------------------------------------------------------------------------------------*/
        /* Set RTC Calender and Time Loading                                                                   */
        /*-----------------------------------------------------------------------------------------------------*/
        RTC_WaitAccessEnable();
        pRTC->CAL = ( uint32_t ) u32RegCAL;
        RTC_WaitAccessEnable();
        pRTC->TIME = ( uint32_t ) u32RegTIME;
    }
}

/**
 * @brief      Update RTC Alarm Date and Time
 *
 * @param[in]  sPt     Specify the time property and alarm date and time. It includes:             \n
 *                     u32Year: Year value, range between 2000 ~ 2099.                             \n
 *                     u32Month: Month value, range between 1 ~ 12.                                \n
 *                     u32Day: Day value, range between 1 ~ 31.                                    \n
 *                     u32DayOfWeek: Day of the week. [RTC_SUNDAY / RTC_MONDAY / RTC_TUESDAY /
 *                                                     RTC_WEDNESDAY / RTC_THURSDAY / RTC_FRIDAY /
 *                                                     RTC_SATURDAY]                               \n
 *                     u32Hour: Hour value, range between 0 ~ 23.                                  \n
 *                     u32Minute: Minute value, range between 0 ~ 59.                              \n
 *                     u32Second: Second value, range between 0 ~ 59.                              \n
 *                     u32TimeScale: [RTC_CLOCK_12 / RTC_CLOCK_24]                                 \n
 *                     u8AmPm: [RTC_AM / RTC_PM]                                                   \n
 *
 * @return     None
 *
 * @details    This API is used to update alarm date and time setting to RTC.
 */
void RTC_SetAlarmDateAndTime( S_RTC_TIME_DATA_T * sPt )
{
    uint32_t u32RegCALM, u32RegTALM;
    RTC_T * pRTC;

    if( ( __PC() & NS_OFFSET ) == NS_OFFSET )
    {
        pRTC = RTC_NS;
    }
    else
    {
        pRTC = RTC;
    }

    if( sPt == 0 )
    {
        /* No RTC date/time data */
    }
    else
    {
        /*-----------------------------------------------------------------------------------------------------*/
        /* Set RTC 24/12 hour setting and Day of the Week                                                      */
        /*-----------------------------------------------------------------------------------------------------*/
        RTC_WaitAccessEnable();

        if( sPt->u32TimeScale == ( uint32_t ) RTC_CLOCK_12 )
        {
            pRTC->CLKFMT &= ~RTC_CLKFMT_24HEN_Msk;

            /*-------------------------------------------------------------------------------------------------*/
            /* Important, range of 12-hour PM mode is 21 up to 32                                               */
            /*-------------------------------------------------------------------------------------------------*/
            if( sPt->u32AmPm == ( uint32_t ) RTC_PM )
            {
                sPt->u32Hour += 20UL;
            }
        }
        else
        {
            pRTC->CLKFMT |= RTC_CLKFMT_24HEN_Msk;
        }

        /*-----------------------------------------------------------------------------------------------------*/
        /* Set RTC Alarm Date and Time                                                                         */
        /*-----------------------------------------------------------------------------------------------------*/
        u32RegCALM = ( ( sPt->u32Year - ( uint32_t ) RTC_YEAR2000 ) / 10UL ) << 20;
        u32RegCALM |= ( ( ( sPt->u32Year - ( uint32_t ) RTC_YEAR2000 ) % 10UL ) << 16 );
        u32RegCALM |= ( ( sPt->u32Month / 10UL ) << 12 );
        u32RegCALM |= ( ( sPt->u32Month % 10UL ) << 8 );
        u32RegCALM |= ( ( sPt->u32Day / 10UL ) << 4 );
        u32RegCALM |= ( sPt->u32Day % 10UL );

        u32RegTALM = ( ( sPt->u32Hour / 10UL ) << 20 );
        u32RegTALM |= ( ( sPt->u32Hour % 10UL ) << 16 );
        u32RegTALM |= ( ( sPt->u32Minute / 10UL ) << 12 );
        u32RegTALM |= ( ( sPt->u32Minute % 10UL ) << 8 );
        u32RegTALM |= ( ( sPt->u32Second / 10UL ) << 4 );
        u32RegTALM |= ( sPt->u32Second % 10UL );

        RTC_WaitAccessEnable();
        pRTC->CALM = ( uint32_t ) u32RegCALM;
        RTC_WaitAccessEnable();
        pRTC->TALM = ( uint32_t ) u32RegTALM;
    }
}

/**
 * @brief      Update RTC Current Date
 *
 * @param[in]  u32Year         The year calendar digit of current RTC setting.
 * @param[in]  u32Month        The month calendar digit of current RTC setting.
 * @param[in]  u32Day          The day calendar digit of current RTC setting.
 * @param[in]  u32DayOfWeek    The Day of the week. [RTC_SUNDAY / RTC_MONDAY / RTC_TUESDAY /
 *                                                   RTC_WEDNESDAY / RTC_THURSDAY / RTC_FRIDAY /
 *                                                   RTC_SATURDAY]
 *
 * @return     None
 *
 * @details    This API is used to update current date to RTC.
 */
void RTC_SetDate( uint32_t u32Year,
                  uint32_t u32Month,
                  uint32_t u32Day,
                  uint32_t u32DayOfWeek )
{
    uint32_t u32RegCAL;
    RTC_T * pRTC;

    if( ( __PC() & NS_OFFSET ) == NS_OFFSET )
    {
        pRTC = RTC_NS;
    }
    else
    {
        pRTC = RTC;
    }

