FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/StdDriver/src/rtc.c
    u32RegCAL = ( ( u32Year - ( uint32_t ) RTC_YEAR2000 ) / 10UL ) << 20;
    u32RegCAL |= ( ( ( u32Year - ( uint32_t ) RTC_YEAR2000 ) % 10UL ) << 16 );
    u32RegCAL |= ( ( u32Month / 10UL ) << 12 );
    u32RegCAL |= ( ( u32Month % 10UL ) << 8 );
    u32RegCAL |= ( ( u32Day / 10UL ) << 4 );
    u32RegCAL |= ( u32Day % 10UL );

    RTC_WaitAccessEnable();

    /* Set Day of the Week */
    pRTC->WEEKDAY = u32DayOfWeek & RTC_WEEKDAY_WEEKDAY_Msk;

    /* Set RTC Calender Loading */
    RTC_WaitAccessEnable();
    pRTC->CAL = ( uint32_t ) u32RegCAL;
}

/**
 * @brief      Update RTC Current Time
 *
 * @param[in]  u32Hour         The hour time digit of current RTC setting.
 * @param[in]  u32Minute       The minute time digit of current RTC setting.
 * @param[in]  u32Second       The second time digit of current RTC setting.
 * @param[in]  u32TimeMode     The 24-Hour / 12-Hour Time Scale Selection. [RTC_CLOCK_12 / RTC_CLOCK_24]
 * @param[in]  u32AmPm         12-hour time scale with AM and PM indication. Only Time Scale select 12-hour used. [RTC_AM / RTC_PM]
 *
 * @return     None
 *
 * @details    This API is used to update current time to RTC.
 */
void RTC_SetTime( uint32_t u32Hour,
                  uint32_t u32Minute,
                  uint32_t u32Second,
                  uint32_t u32TimeMode,
                  uint32_t u32AmPm )
{
    uint32_t u32RegTIME;
    RTC_T * pRTC;

    if( ( __PC() & NS_OFFSET ) == NS_OFFSET )
    {
        pRTC = RTC_NS;
    }
    else
    {
        pRTC = RTC;
    }

    /* Important, range of 12-hour PM mode is 21 up to 32 */
    if( ( u32TimeMode == ( uint32_t ) RTC_CLOCK_12 ) && ( u32AmPm == ( uint32_t ) RTC_PM ) )
    {
        u32Hour += 20UL;
    }

    u32RegTIME = ( ( u32Hour / 10UL ) << 20 );
    u32RegTIME |= ( ( u32Hour % 10UL ) << 16 );
    u32RegTIME |= ( ( u32Minute / 10UL ) << 12 );
    u32RegTIME |= ( ( u32Minute % 10UL ) << 8 );
    u32RegTIME |= ( ( u32Second / 10UL ) << 4 );
    u32RegTIME |= ( u32Second % 10UL );

    /*-----------------------------------------------------------------------------------------------------*/
    /* Set RTC 24/12 hour setting and Day of the Week                                                      */
    /*-----------------------------------------------------------------------------------------------------*/
    RTC_WaitAccessEnable();

    if( u32TimeMode == ( uint32_t ) RTC_CLOCK_12 )
    {
        pRTC->CLKFMT &= ~RTC_CLKFMT_24HEN_Msk;
    }
    else
    {
        pRTC->CLKFMT |= RTC_CLKFMT_24HEN_Msk;
    }

    RTC_WaitAccessEnable();
    pRTC->TIME = ( uint32_t ) u32RegTIME;
}

/**
 * @brief      Update RTC Alarm Date
 *
 * @param[in]  u32Year         The year calendar digit of RTC alarm setting.
 * @param[in]  u32Month        The month calendar digit of RTC alarm setting.
 * @param[in]  u32Day          The day calendar digit of RTC alarm setting.
 *
 * @return     None
 *
 * @details    This API is used to update alarm date setting to RTC.
 */
void RTC_SetAlarmDate( uint32_t u32Year,
                       uint32_t u32Month,
                       uint32_t u32Day )
{
    uint32_t u32RegCALM;
    RTC_T * pRTC;

    if( ( __PC() & NS_OFFSET ) == NS_OFFSET )
    {
        pRTC = RTC_NS;
    }
    else
    {
        pRTC = RTC;
    }

    u32RegCALM = ( ( u32Year - ( uint32_t ) RTC_YEAR2000 ) / 10UL ) << 20;
    u32RegCALM |= ( ( ( u32Year - ( uint32_t ) RTC_YEAR2000 ) % 10UL ) << 16 );
    u32RegCALM |= ( ( u32Month / 10UL ) << 12 );
    u32RegCALM |= ( ( u32Month % 10UL ) << 8 );
    u32RegCALM |= ( ( u32Day / 10UL ) << 4 );
    u32RegCALM |= ( u32Day % 10UL );

    RTC_WaitAccessEnable();

    /* Set RTC Alarm Date */
    pRTC->CALM = ( uint32_t ) u32RegCALM;
}

/**
 * @brief      Update RTC Alarm Time
 *
 * @param[in]  u32Hour         The hour time digit of RTC alarm setting.
 * @param[in]  u32Minute       The minute time digit of RTC alarm setting.
 * @param[in]  u32Second       The second time digit of RTC alarm setting.
 * @param[in]  u32TimeMode     The 24-Hour / 12-Hour Time Scale Selection. [RTC_CLOCK_12 / RTC_CLOCK_24]
 * @param[in]  u32AmPm         12-hour time scale with AM and PM indication. Only Time Scale select 12-hour used. [RTC_AM / RTC_PM]
 *
 * @return     None
 *
 * @details    This API is used to update alarm time setting to RTC.
 */
void RTC_SetAlarmTime( uint32_t u32Hour,
                       uint32_t u32Minute,
                       uint32_t u32Second,
                       uint32_t u32TimeMode,
                       uint32_t u32AmPm )
{
    uint32_t u32RegTALM;
    RTC_T * pRTC;

    if( ( __PC() & NS_OFFSET ) == NS_OFFSET )
    {
        pRTC = RTC_NS;
    }
    else
    {
        pRTC = RTC;
    }

    /* Important, range of 12-hour PM mode is 21 up to 32 */
    if( ( u32TimeMode == ( uint32_t ) RTC_CLOCK_12 ) && ( u32AmPm == ( uint32_t ) RTC_PM ) )
    {
        u32Hour += 20UL;
    }

    u32RegTALM = ( ( u32Hour / 10UL ) << 20 );
    u32RegTALM |= ( ( u32Hour % 10UL ) << 16 );
    u32RegTALM |= ( ( u32Minute / 10UL ) << 12 );
    u32RegTALM |= ( ( u32Minute % 10UL ) << 8 );
    u32RegTALM |= ( ( u32Second / 10UL ) << 4 );
    u32RegTALM |= ( u32Second % 10UL );

    /*-----------------------------------------------------------------------------------------------------*/
    /* Set RTC 24/12 hour setting and Day of the Week                                                      */
    /*-----------------------------------------------------------------------------------------------------*/
    RTC_WaitAccessEnable();

    if( u32TimeMode == ( uint32_t ) RTC_CLOCK_12 )
    {
        pRTC->CLKFMT &= ~RTC_CLKFMT_24HEN_Msk;
    }
    else
    {
        pRTC->CLKFMT |= RTC_CLKFMT_24HEN_Msk;
    }

    /* Set RTC Alarm Time */
    RTC_WaitAccessEnable();
    pRTC->TALM = ( uint32_t ) u32RegTALM;
}

/**
 * @brief      Set RTC Alarm Date Mask Function
 *
 * @param[in]  u8IsTenYMsk     1: enable 10-Year digit alarm mask; 0: disabled.
 * @param[in]  u8IsYMsk        1: enable 1-Year digit alarm mask; 0: disabled.
 * @param[in]  u8IsTenMMsk     1: enable 10-Mon digit alarm mask; 0: disabled.
 * @param[in]  u8IsMMsk        1: enable 1-Mon digit alarm mask; 0: disabled.
 * @param[in]  u8IsTenDMsk     1: enable 10-Day digit alarm mask; 0: disabled.
 * @param[in]  u8IsDMsk        1: enable 1-Day digit alarm mask; 0: disabled.
 *
 * @return     None
 *
 * @details    This API is used to enable or disable RTC alarm date mask function.
 */
void RTC_SetAlarmDateMask( uint8_t u8IsTenYMsk,
                           uint8_t u8IsYMsk,
                           uint8_t u8IsTenMMsk,
                           uint8_t u8IsMMsk,
                           uint8_t u8IsTenDMsk,
                           uint8_t u8IsDMsk )
{
    RTC_T * pRTC;

    if( ( __PC() & NS_OFFSET ) == NS_OFFSET )
    {
        pRTC = RTC_NS;
    }
    else
    {
        pRTC = RTC;
    }

    RTC_WaitAccessEnable();
    pRTC->CAMSK = ( ( uint32_t ) u8IsTenYMsk << RTC_CAMSK_MTENYEAR_Pos ) |
                  ( ( uint32_t ) u8IsYMsk << RTC_CAMSK_MYEAR_Pos ) |
                  ( ( uint32_t ) u8IsTenMMsk << RTC_CAMSK_MTENMON_Pos ) |
                  ( ( uint32_t ) u8IsMMsk << RTC_CAMSK_MMON_Pos ) |
                  ( ( uint32_t ) u8IsTenDMsk << RTC_CAMSK_MTENDAY_Pos ) |
                  ( ( uint32_t ) u8IsDMsk << RTC_CAMSK_MDAY_Pos );
}

/**
 * @brief      Set RTC Alarm Time Mask Function
 *
 * @param[in]  u8IsTenHMsk     1: enable 10-Hour digit alarm mask; 0: disabled.
 * @param[in]  u8IsHMsk        1: enable 1-Hour digit alarm mask; 0: disabled.
 * @param[in]  u8IsTenMMsk     1: enable 10-Min digit alarm mask; 0: disabled.
 * @param[in]  u8IsMMsk        1: enable 1-Min digit alarm mask; 0: disabled.
 * @param[in]  u8IsTenSMsk     1: enable 10-Sec digit alarm mask; 0: disabled.
 * @param[in]  u8IsSMsk        1: enable 1-Sec digit alarm mask; 0: disabled.
 *
 * @return     None
 *
 * @details    This API is used to enable or disable RTC alarm time mask function.
 */
void RTC_SetAlarmTimeMask( uint8_t u8IsTenHMsk,
                           uint8_t u8IsHMsk,
                           uint8_t u8IsTenMMsk,
                           uint8_t u8IsMMsk,
                           uint8_t u8IsTenSMsk,
                           uint8_t u8IsSMsk )
{
    RTC_T * pRTC;

    if( ( __PC() & NS_OFFSET ) == NS_OFFSET )
    {
        pRTC = RTC_NS;
    }
    else
    {
        pRTC = RTC;
    }

    RTC_WaitAccessEnable();
    pRTC->TAMSK = ( ( uint32_t ) u8IsTenHMsk << RTC_TAMSK_MTENHR_Pos ) |
                  ( ( uint32_t ) u8IsHMsk << RTC_TAMSK_MHR_Pos ) |
                  ( ( uint32_t ) u8IsTenMMsk << RTC_TAMSK_MTENMIN_Pos ) |
                  ( ( uint32_t ) u8IsMMsk << RTC_TAMSK_MMIN_Pos ) |
                  ( ( uint32_t ) u8IsTenSMsk << RTC_TAMSK_MTENSEC_Pos ) |
                  ( ( uint32_t ) u8IsSMsk << RTC_TAMSK_MSEC_Pos );
}

/**
 * @brief      Get Day of the Week
 *
 * @param      None
 *
 * @retval     0   Sunday
 * @retval     1   Monday
 * @retval     2   Tuesday
 * @retval     3   Wednesday
 * @retval     4   Thursday
 * @retval     5   Friday
 * @retval     6   Saturday
 *
 * @details    This API is used to get day of the week of current RTC date.
 */
uint32_t RTC_GetDayOfWeek( void )
{
    RTC_T * pRTC;

    if( ( __PC() & NS_OFFSET ) == NS_OFFSET )
    {
        pRTC = RTC_NS;
    }
    else
    {
        pRTC = RTC;
    }

