FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/StdDriver/src/rtc.c
    return( pRTC->WEEKDAY & RTC_WEEKDAY_WEEKDAY_Msk );
}

/**
 * @brief      Set RTC Tick Period Time
 *
 * @param[in]  u32TickSelection    It is used to set the RTC tick period time for Periodic Time Tick request. \n
 *                                 It consists of:
 *                                     - \ref RTC_TICK_1_SEC     : Time tick is 1 second
 *                                     - \ref RTC_TICK_1_2_SEC   : Time tick is 1/2 second
 *                                     - \ref RTC_TICK_1_4_SEC   : Time tick is 1/4 second
 *                                     - \ref RTC_TICK_1_8_SEC   : Time tick is 1/8 second
 *                                     - \ref RTC_TICK_1_16_SEC  : Time tick is 1/16 second
 *                                     - \ref RTC_TICK_1_32_SEC  : Time tick is 1/32 second
 *                                     - \ref RTC_TICK_1_64_SEC  : Time tick is 1/64 second
 *                                     - \ref RTC_TICK_1_128_SEC : Time tick is 1/128 second
 *
 * @return     None
 *
 * @details    This API is used to set RTC tick period time for each tick interrupt.
 */
void RTC_SetTickPeriod( uint32_t u32TickSelection )
{
    RTC_T * pRTC;

    if( ( __PC() & NS_OFFSET ) == NS_OFFSET )
    {
        pRTC = RTC_NS;
    }
    else
    {
        pRTC = RTC;
    }

    RTC_WaitAccessEnable();

    pRTC->TICK = ( pRTC->TICK & ~RTC_TICK_TICK_Msk ) | u32TickSelection;
}

/**
 * @brief      Enable RTC Interrupt
 *
 * @param[in]  u32IntFlagMask      Specify the interrupt source. It consists of:
 *                                     - \ref RTC_INTEN_ALMIEN_Msk   : Alarm interrupt
 *                                     - \ref RTC_INTEN_TICKIEN_Msk  : Tick interrupt
 *                                     - \ref RTC_INTEN_TAMP0IEN_Msk : Tamper 0 Pin Event Detection interrupt
 *                                     - \ref RTC_INTEN_TAMP1IEN_Msk : Tamper 1 or Pair 0 Pin Event Detection interrupt
 *                                     - \ref RTC_INTEN_TAMP2IEN_Msk : Tamper 2 Pin Event Detection interrupt
 *                                     - \ref RTC_INTEN_TAMP3IEN_Msk : Tamper 3 or Pair 1 Pin Event Detection interrupt
 *                                     - \ref RTC_INTEN_TAMP4IEN_Msk : Tamper 4 Pin Event Detection interrupt
 *                                     - \ref RTC_INTEN_TAMP5IEN_Msk : Tamper 5 or Pair 2 Pin Event Detection interrupt
 *                                     - \ref RTC_INTEN_CLKFIEN_Msk  : LXT Clock Frequency Monitor Fail interrupt
 *                                     - \ref RTC_INTEN_CLKSPIEN_Msk : LXT Clock Frequency Monitor Stop interrupt
 *
 * @return     None
 *
 * @details    This API is used to enable the specify RTC interrupt function.
 */
void RTC_EnableInt( uint32_t u32IntFlagMask )
{
    RTC_T * pRTC;

    if( ( __PC() & NS_OFFSET ) == NS_OFFSET )
    {
        pRTC = RTC_NS;
    }
    else
    {
        pRTC = RTC;
    }

    pRTC->INTEN |= u32IntFlagMask;
}

/**
 * @brief      Disable RTC Interrupt
 *
 * @param[in]  u32IntFlagMask      Specify the interrupt source. It consists of:
 *                                     - \ref RTC_INTEN_ALMIEN_Msk   : Alarm interrupt
 *                                     - \ref RTC_INTEN_TICKIEN_Msk  : Tick interrupt
 *                                     - \ref RTC_INTEN_TAMP0IEN_Msk : Tamper 0 Pin Event Detection interrupt
 *                                     - \ref RTC_INTEN_TAMP1IEN_Msk : Tamper 1 or Pair 0 Pin Event Detection interrupt
 *                                     - \ref RTC_INTEN_TAMP2IEN_Msk : Tamper 2 Pin Event Detection interrupt
 *                                     - \ref RTC_INTEN_TAMP3IEN_Msk : Tamper 3 or Pair 1 Pin Event Detection interrupt
 *                                     - \ref RTC_INTEN_TAMP4IEN_Msk : Tamper 4 Pin Event Detection interrupt
 *                                     - \ref RTC_INTEN_TAMP5IEN_Msk : Tamper 5 or Pair 2 Pin Event Detection interrupt
 *                                     - \ref RTC_INTEN_CLKFIEN_Msk  : LXT Clock Frequency Monitor Fail interrupt
 *                                     - \ref RTC_INTEN_CLKSPIEN_Msk : LXT Clock Frequency Monitor Stop interrupt
 *
 * @return     None
 *
 * @details    This API is used to disable the specify RTC interrupt function.
 */
void RTC_DisableInt( uint32_t u32IntFlagMask )
{
    RTC_T * pRTC;

    if( ( __PC() & NS_OFFSET ) == NS_OFFSET )
    {
        pRTC = RTC_NS;
    }
    else
    {
        pRTC = RTC;
    }

    pRTC->INTEN &= ~u32IntFlagMask;
    pRTC->INTSTS = u32IntFlagMask;
}

/**
 * @brief      Enable Spare Registers Access
 *
 * @param      None
 *
 * @return     None
 *
 * @details    This API is used to enable the spare registers 0~19 can be accessed.
 */
void RTC_EnableSpareAccess( void )
{
    RTC_T * pRTC;

    if( ( __PC() & NS_OFFSET ) == NS_OFFSET )
    {
        pRTC = RTC_NS;
    }
    else
    {
        pRTC = RTC;
    }

    RTC_WaitAccessEnable();

    pRTC->SPRCTL |= RTC_SPRCTL_SPRRWEN_Msk;
}

/**
 * @brief      Disable Spare Register
 *
 * @param      None
 *
 * @return     None
 *
 * @details    This API is used to disable the spare register 0~19 cannot be accessed.
 */
void RTC_DisableSpareRegister( void )
{
    RTC_T * pRTC;

    if( ( __PC() & NS_OFFSET ) == NS_OFFSET )
    {
        pRTC = RTC_NS;
    }
    else
    {
        pRTC = RTC;
    }

    RTC_WaitAccessEnable();

    pRTC->SPRCTL &= ~RTC_SPRCTL_SPRRWEN_Msk;
}

/**
 * @brief      Static Tamper Detect
 *
 * @param[in]  u32TamperSelect     Tamper pin select. Possible options are
 *                                 - \ref RTC_TAMPER5_SELECT
 *                                 - \ref RTC_TAMPER4_SELECT
 *                                 - \ref RTC_TAMPER3_SELECT
 *                                 - \ref RTC_TAMPER2_SELECT
 *                                 - \ref RTC_TAMPER1_SELECT
 *                                 - \ref RTC_TAMPER0_SELECT
 *
 * @param[in]  u32DetecLevel       Tamper pin detection level select. Possible options are
 *                                 - \ref RTC_TAMPER_HIGH_LEVEL_DETECT
 *                                 - \ref RTC_TAMPER_LOW_LEVEL_DETECT
 *
 * @param[in]  u32DebounceEn       Tamper pin de-bounce enable
 *                                 - \ref RTC_TAMPER_DEBOUNCE_ENABLE
 *                                 - \ref RTC_TAMPER_DEBOUNCE_DISABLE
 *
 * @return     None
 *
 * @details    This API is used to enable the tamper pin detect function with specify trigger condition.
 *             User need disable dynamic tamper function before use this API.
 */
void RTC_StaticTamperEnable( uint32_t u32TamperSelect,
                             uint32_t u32DetecLevel,
                             uint32_t u32DebounceEn )
{
    uint32_t i;
    uint32_t u32Reg;
    uint32_t u32TmpReg;
    RTC_T * pRTC;

    if( ( __PC() & NS_OFFSET ) == NS_OFFSET )
    {
        pRTC = RTC_NS;
    }
    else
    {
        pRTC = RTC;
    }

    RTC_WaitAccessEnable();
    u32Reg = pRTC->TAMPCTL;

    u32TmpReg = ( RTC_TAMPCTL_TAMP0EN_Msk | ( u32DetecLevel << RTC_TAMPCTL_TAMP0LV_Pos ) |
                  ( u32DebounceEn << RTC_TAMPCTL_TAMP0DBEN_Pos ) );

    for( i = 0UL; i < ( uint32_t ) MAX_TAMPER_PIN_NUM; i++ )
    {
        if( u32TamperSelect & ( 0x1UL << i ) )
        {
            u32Reg &= ~( ( RTC_TAMPCTL_TAMP0EN_Msk | RTC_TAMPCTL_TAMP0LV_Msk | RTC_TAMPCTL_TAMP0DBEN_Msk ) << ( i * 4UL ) );
            u32Reg |= ( u32TmpReg << ( i * 4UL ) );
        }
    }

    RTC_WaitAccessEnable();
    pRTC->TAMPCTL = u32Reg;
}

/**
 * @brief      Static Tamper Disable
 *
 * @param[in]  u32TamperSelect     Tamper pin select. Possible options are
 *                                 - \ref RTC_TAMPER5_SELECT
 *                                 - \ref RTC_TAMPER4_SELECT
 *                                 - \ref RTC_TAMPER3_SELECT
 *                                 - \ref RTC_TAMPER2_SELECT
 *                                 - \ref RTC_TAMPER1_SELECT
 *                                 - \ref RTC_TAMPER0_SELECT
 *
 * @return     None
 *
 * @details    This API is used to disable the static tamper pin detect.
 */
void RTC_StaticTamperDisable( uint32_t u32TamperSelect )
{
    uint32_t i;
    uint32_t u32Reg;
    uint32_t u32TmpReg;
    RTC_T * pRTC;

    if( ( __PC() & NS_OFFSET ) == NS_OFFSET )
    {
        pRTC = RTC_NS;
    }
    else
    {
        pRTC = RTC;
    }

    RTC_WaitAccessEnable();
    u32Reg = pRTC->TAMPCTL;

    u32TmpReg = ( RTC_TAMPCTL_TAMP0EN_Msk );

    for( i = 0UL; i < ( uint32_t ) MAX_TAMPER_PIN_NUM; i++ )
    {
        if( u32TamperSelect & ( 0x1UL << i ) )
        {
            u32Reg &= ~( u32TmpReg << ( i * 4UL ) );
        }
    }

    RTC_WaitAccessEnable();
    pRTC->TAMPCTL = u32Reg;
}

/**
 * @brief      Dynamic Tamper Detect
 *
 * @param[in]  u32PairSel          Tamper pin detection enable. Possible options are
 *                                 - \ref RTC_PAIR0_SELECT
 *                                 - \ref RTC_PAIR1_SELECT
 *                                 - \ref RTC_PAIR2_SELECT
 *
 * @param[in]  u32DebounceEn       Tamper pin de-bounce enable
 *                                 - \ref RTC_TAMPER_DEBOUNCE_ENABLE
 *                                 - \ref RTC_TAMPER_DEBOUNCE_DISABLE
 *
 *  @param[in]  u32Pair1Source     Dynamic Pair 1 Input Source Select
 *                                 0: Pair 1 source select tamper 2
 *                                 1: Pair 1 source select tamper 0
 *
 *  @param[in]  u32Pair2Source     Dynamic Pair 2 Input Source Select
 *                                 0: Pair 2 source select tamper 4
 *                                 1: Pair 2 source select tamper 0
 *
 * @return     None
 *
 * @details    This API is used to enable the dynamic tamper.
 */
void RTC_DynamicTamperEnable( uint32_t u32PairSel,
                              uint32_t u32DebounceEn,
                              uint32_t u32Pair1Source,
                              uint32_t u32Pair2Source )
{
    uint32_t i;
    uint32_t u32Reg;
    uint32_t u32TmpReg;
    uint32_t u32Tamper2Debounce, u32Tamper4Debounce;
    RTC_T * pRTC;

    if( ( __PC() & NS_OFFSET ) == NS_OFFSET )
    {
        pRTC = RTC_NS;
    }
    else
    {
        pRTC = RTC;
    }

    RTC_WaitAccessEnable();
    u32Reg = pRTC->TAMPCTL;
    u32Reg &= ~( RTC_TAMPCTL_TAMP0EN_Msk | RTC_TAMPCTL_TAMP1EN_Msk | RTC_TAMPCTL_TAMP2EN_Msk |
                 RTC_TAMPCTL_TAMP3EN_Msk | RTC_TAMPCTL_TAMP4EN_Msk | RTC_TAMPCTL_TAMP5EN_Msk );

    u32Tamper2Debounce = u32Reg & RTC_TAMPCTL_TAMP2DBEN_Msk;
    u32Tamper4Debounce = u32Reg & RTC_TAMPCTL_TAMP4DBEN_Msk;

    u32Reg &= ~( RTC_TAMPCTL_TAMP0EN_Msk | RTC_TAMPCTL_TAMP1EN_Msk | RTC_TAMPCTL_TAMP2EN_Msk |
                 RTC_TAMPCTL_TAMP3EN_Msk | RTC_TAMPCTL_TAMP4EN_Msk | RTC_TAMPCTL_TAMP5EN_Msk );
    u32Reg &= ~( RTC_TAMPCTL_DYN1ISS_Msk | RTC_TAMPCTL_DYN2ISS_Msk );
    u32Reg |= ( ( u32Pair1Source & 0x1UL ) << RTC_TAMPCTL_DYN1ISS_Pos ) | ( ( u32Pair2Source & 0x1UL ) << RTC_TAMPCTL_DYN2ISS_Pos );

    if( u32DebounceEn )
    {
        u32TmpReg = ( RTC_TAMPCTL_TAMP0EN_Msk | RTC_TAMPCTL_TAMP1EN_Msk |
                      RTC_TAMPCTL_TAMP0DBEN_Msk | RTC_TAMPCTL_TAMP1DBEN_Msk | RTC_TAMPCTL_DYNPR0EN_Msk );
    }
    else
    {
        u32TmpReg = ( RTC_TAMPCTL_TAMP0EN_Msk | RTC_TAMPCTL_TAMP1EN_Msk | RTC_TAMPCTL_DYNPR0EN_Msk );
    }

    for( i = 0UL; i < ( uint32_t ) MAX_PAIR_NUM; i++ )
    {
        if( u32PairSel & ( 0x1UL << i ) )
        {
            u32Reg &= ~( ( RTC_TAMPCTL_TAMP0DBEN_Msk | RTC_TAMPCTL_TAMP1DBEN_Msk ) << ( i * 8UL ) );
            u32Reg |= ( u32TmpReg << ( i * 8UL ) );
        }
    }

