FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/StdDriver/src/rtc.c
    if( ( u32Pair1Source ) && ( u32PairSel & ( uint32_t ) RTC_PAIR1_SELECT ) )
    {
        u32Reg &= ~RTC_TAMPCTL_TAMP2EN_Msk;
        u32Reg |= u32Tamper2Debounce;
    }

    if( ( u32Pair2Source ) && ( u32PairSel & ( uint32_t ) RTC_PAIR2_SELECT ) )
    {
        u32Reg &= ~RTC_TAMPCTL_TAMP4EN_Msk;
        u32Reg |= u32Tamper4Debounce;
    }

    RTC_WaitAccessEnable();
    pRTC->TAMPCTL = u32Reg;
}

/**
 * @brief      Dynamic Tamper Disable
 *
 * @param[in]  u32PairSel          Tamper pin detection enable. Possible options are
 *                                 - \ref RTC_PAIR0_SELECT
 *                                 - \ref RTC_PAIR1_SELECT
 *                                 - \ref RTC_PAIR2_SELECT
 *
 * @return     None
 *
 * @details    This API is used to disable the dynamic tamper.
 */
void RTC_DynamicTamperDisable( uint32_t u32PairSel )
{
    uint32_t i;
    uint32_t u32Reg;
    uint32_t u32TmpReg;
    uint32_t u32Tamper2En = 0UL, u32Tamper4En = 0UL;
    RTC_T * pRTC;

    if( ( __PC() & NS_OFFSET ) == NS_OFFSET )
    {
        pRTC = RTC_NS;
    }
    else
    {
        pRTC = RTC;
    }

    RTC_WaitAccessEnable();
    u32Reg = pRTC->TAMPCTL;

    if( ( u32Reg & ( uint32_t ) RTC_TAMPCTL_DYN1ISS_Msk ) && ( u32PairSel & ( uint32_t ) RTC_PAIR1_SELECT ) )
    {
        u32Tamper2En = u32Reg & RTC_TAMPCTL_TAMP2EN_Msk;
    }

    if( ( u32Reg & ( uint32_t ) RTC_TAMPCTL_DYN2ISS_Msk ) && ( u32PairSel & ( uint32_t ) RTC_PAIR2_SELECT ) )
    {
        u32Tamper4En = u32Reg & RTC_TAMPCTL_TAMP4EN_Msk;
    }

    u32TmpReg = ( RTC_TAMPCTL_TAMP0EN_Msk | RTC_TAMPCTL_TAMP1EN_Msk | RTC_TAMPCTL_DYNPR0EN_Msk );

    for( i = 0UL; i < ( uint32_t ) MAX_PAIR_NUM; i++ )
    {
        if( u32PairSel & ( 0x1UL << i ) )
        {
            u32Reg &= ~( u32TmpReg << ( ( i * 8UL ) ) );
        }
    }

    u32Reg |= ( u32Tamper2En | u32Tamper4En );

    RTC_WaitAccessEnable();
    pRTC->TAMPCTL = u32Reg;
}

/**
 * @brief      Config dynamic tamper
 *
 * @param[in]  u32ChangeRate       The dynamic tamper output change rate
 *                                 - \ref RTC_2POW10_CLK
 *                                 - \ref RTC_2POW11_CLK
 *                                 - \ref RTC_2POW12_CLK
 *                                 - \ref RTC_2POW13_CLK
 *                                 - \ref RTC_2POW14_CLK
 *                                 - \ref RTC_2POW15_CLK
 *                                 - \ref RTC_2POW16_CLK
 *                                 - \ref RTC_2POW17_CLK
 *
 * @param[in]  u32SeedReload       Reload new seed or not
 *                                 0: not reload new seed
 *                                 1: reload new seed
 *
 * @param[in]  u32RefPattern       Reference pattern
 *                                 - \ref REF_RANDOM_PATTERN
 *                                 - \ref REF_PREVIOUS_PATTERN
 *                                 - \ref REF_SEED
 *
 * @param[in]  u32Seed             Seed Value (0x0 ~ 0xFFFFFFFF)
 *
 * @return     None
 *
 * @details    This API is used to config dynamic tamper setting.
 */
void RTC_DynamicTamperConfig( uint32_t u32ChangeRate,
                              uint32_t u32SeedReload,
                              uint32_t u32RefPattern,
                              uint32_t u32Seed )
{
    uint32_t u32Reg;
    RTC_T * pRTC;

    if( ( __PC() & NS_OFFSET ) == NS_OFFSET )
    {
        pRTC = RTC_NS;
    }
    else
    {
        pRTC = RTC;
    }

    RTC_WaitAccessEnable();
    u32Reg = pRTC->TAMPCTL;

    u32Reg &= ~( RTC_TAMPCTL_DYNSRC_Msk | RTC_TAMPCTL_SEEDRLD_Msk | RTC_TAMPCTL_DYNRATE_Msk );

    u32Reg |= ( u32ChangeRate ) | ( ( u32SeedReload & 0x1UL ) << RTC_TAMPCTL_SEEDRLD_Pos ) |
              ( ( u32RefPattern & 0x3UL ) << RTC_TAMPCTL_DYNSRC_Pos );

    RTC_WaitAccessEnable();
    pRTC->TAMPSEED = u32Seed; /* need set seed value before re-loade seed */
    pRTC->TAMPCTL = u32Reg;
}

/*@}*/ /* end of group RTC_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group RTC_Driver */

/*@}*/ /* end of group Standard_Driver */

/*** (C) COPYRIGHT 2016 Nuvoton Technology Corp. ***/
